# -*- coding: utf-8 -*-

# (цикл while)

# Ежемесячная стипендия студента составляет educational_grant руб., а расходы на проживание превышают стипендию
# и составляют expenses руб. в месяц. Рост цен ежемесячно увеличивает расходы на 3%, кроме первого месяца
# Составьте программу расчета суммы денег, которую необходимо единовременно попросить у родителей,
# чтобы можно было прожить учебный год (10 месяцев), используя только эти деньги и стипендию.
# Формат вывода:
#   Студенту надо попросить ХХХ.ХХ рублей

educational_grant, expenses = 10000, 12000
need_money, all_month, now_month = 0, 10, 1

while all_month >= now_month:
    need_money += expenses - educational_grant
    expenses += (expenses * 0.03)
    now_month += 1
print("Студенту надо попросить ", round(need_money, 2), " рублей")

# зачет!
