# -*- coding: utf-8 -*-

# Есть список карьерных самосвалов: марка, пройденный путь, перевезенный груз
haulers = [
    ['Caterpillar', 0, 0],
    ['Komatsu', 0, 0],
    ['Hitachi', 0, 0],
    ['Белаз', 0, 0],
]

# Нужно вывести на консоль список всех самосвалов
#     Марка AAA, путь - BBB км, груз - CC тонн
# А затем нужно вывести общее число самосвалов,
# полный пройденный путь и массу груза, перевезенноего всеми
# в формате
#     Всего самосвалов XX штук.
#     Всего пробег - YYY км.
#     Перевезено груза - ZZZ тонн.

# Есть словарь карьерных самосвалов: марка - шофер, пройденный путь, перевезенный груз
haulers = {
    'Caterpillar': [
        ['Стаханов', 0, 0],
        ['Ленивцев', 0, 0],
        ['Шачков', 0, 0],
    ],
    'Komatsu': [
        ['Стаханов', 0, 0],
        ['Ленивцев', 0, 0],
        ['Шачков', 0, 0],
    ],
    'Hitachi': [
        ['Стаханов', 0, 0],
        ['Ленивцев', 0, 0],
        ['Шачков', 0, 0],
    ],
    'Белаз': [
        ['Стаханов', 0, 0],
        ['Ленивцев', 0, 0],
        ['Шачков', 0, 0],
    ],
}
