
# Создать модуль my_burger. В нем определить функции добавления инградиентов:
#  - булочки
#  - котлеты
#  - огурчика
#  - помидорчика
#  - майонеза
#  - сыра

def add_bread():
    print("А теперь добавим булочку")

def add_cutlet():
    print("А теперь добавим котлеты")

def add_cucumber():
    print("А теперь добавим огурчик")

def add_tomato():
    print("А теперь добавим помидорчика")

def add_mayoneza():
    print("А теперь добавим майонеза")

def add_cheese():
    print("А теперь добавим сыра")

def add_salad():
    print("А теперь добавим салат")

def add_beckon():
    print("А теперь добавим бекон")

def add_ketchup():
    print("А теперь добавим кетчуп")