# -*- coding: utf-8 -*-

# Задача: написать чат бот по продаже напитков

# Шаг 1 - на любое сообщение писать: "Я робот, я продаю напитки. Для справки напишите Меню".
# Шаг 2 - на сообщение меню писать: "Сегодня в продаже: 1 - минералка, 2 - молоко, 3 - чай"
# Шаг 2 - на сообщение из одной цифры, проверить что 1 <= X <= 3
#   если нет - то написать "У нас только три напитка!"
#   если да - то выдать картинку с напитком
#           и сообщение "Вот ваш ХХХ. Спасибо, что воспользовались нашими услугами"
